{
    "Home": "家",
    "Projects": "プロジェクト",
    "Experience": "経験",
    "Certification": "認証",
    "Certifications": "認証",
    "Hello" : "こんにちは",
    "I am": "私は",
    "I am Zarrar Abid": "私はザラール・アビドです",
    "I am a Developer" : "私は開発者です",
    "I am an Engineer" : "私はエンジニアです",
    "I am a Programmer": "私はプログラマーです",
    "I am an avid learner" : "私は熱心な学習者です",
    "I am dedicated to crafting exceptional user experiences by leveraging the latest cutting-edge technologies. My focus is on building robust, secure, and accessible websites that are not only interactive but also enjoyable to use. With a strong grasp of back-end technologies, I seamlessly integrate them into my workflow, ensuring a cohesive and efficient development process. My meticulous attention to detail guarantees that every product I deliver aligns perfectly with the design vision, creating a delightful experience for users." : "最先端の技術を駆使し、卓越したユーザーエクスペリエンスを提供することに尽力しています。堅牢で安全、そしてアクセス性に優れ、インタラクティブであるだけでなく、楽しく使えるウェブサイトの構築に注力しています。バックエンド技術を深く理解し、それらをワークフローにシームレスに統合することで、一貫性と効率性に優れた開発プロセスを実現します。細部にまでこだわることで、提供するすべての製品がデザインビジョンと完璧に一致し、ユーザーに素晴らしい体験を提供することを保証しています。",
    "Download Resume": "履歴書のダウンロード",
    "Send Me a message": "メッセージを送ってください",
    "Technologies I Use": "私が使用しているテクノロジー",
    "You Got It! I am a Javascript Buff": "分かりました！私は Javascript の達人です",
    "What is Javascript": "JavaScript とは",
    "JavaScript, or JS, is the dynamic force behind most websites, bringing interactivity and flair to the web. With over 97% of sites harnessing its power, it’s essential for creating engaging user experiences—from animations to responsive applications. Unleash your creativity with JS!": "JavaScript（JS）は、ほとんどのウェブサイトを支える原動力であり、ウェブにインタラクティブ性と魅力をもたらします。97% 以上のウェブサイトがその力を活用しており、アニメーションからレスポンシブなアプリケーションまで、魅力的なユーザーエクスペリエンスの実現に不可欠です。JS であなたの創造性を解き放ちましょう！",
    "Who is Zarrar Abid?" : "ザラール・アビドとは誰ですか?",
    "Hi, Hello, Assalam U Alaikum...": "こんにちは, Assalam U Alaikum...",
    "A Glimpse into My Toolkit": "私のツールキットをちょっと覗いてみよう",
    "In this section, I’ll share the powerful tools and technologies that fuel my development journey. From frameworks to databases, each component is carefully chosen to enhance productivity and creativity. Get ready to explore the building blocks of my projects!" : "このセクションでは、私の開発の旅を支えている強力なツールとテクノロジーをご紹介します。フレームワークからデータベースまで、それぞれのコンポーネントは生産性と創造性を高めるために厳選されています。さあ、私のプロジェクトの構成要素を探求してみましょう！",
    "Brilliant ideas need a spark! Fueled by bold moves and relentless grit. Why? Because..." : "素晴らしいアイデアにはひらめきが必要です！ 大胆な行動と不屈の精神が原動力です。なぜでしょう？ それは…",
    "THE SECRET TO SUCCESS IS..." : "成功の秘訣は...",
    "UNSTOPPABLE CONSISTENCY!" : "止められない一貫性！",
    "App that allows you to create and organize your notes seamlessly with search filter." : "検索フィルターを使用して、メモをシームレスに作成および整理できるアプリ。",
    "A Character Generator App with extensive customization options, users can select from various hairstyles, facial features, background, and accessories." : "幅広いカスタマイズ オプションを備えたキャラクター ジェネレーター アプリで、ユーザーはさまざまな髪型、顔の特徴、背景、アクセサリを選択できます。",
    "ColorMind is a web app that helps users receive color recommendations based on a context." : "ColorMind は、ユーザーがコンテキストに基づいて色の推奨を受け取るのに役立つ Web アプリです。",
    "This Project helps Los Angeles residents book requests to install solar panels at there home." : "このプロジェクトは、ロサンゼルスの住民が自宅にソーラーパネルを設置するための予約をするのに役立ちます。",
    "A cutting-edge App to streamline the hiring process for drivers, ensuring a seamless user experience through advanced technology." : "ドライバーの雇用プロセスを合理化し、高度なテクノロジーを通じてシームレスなユーザー エクスペリエンスを保証する最先端のアプリです。",
    "This project is a multi-restaurant food ordering website, similar to Glovo, where users can browse and purchase meals from various restaurants all in one place." : "このプロジェクトは、Glovo に似た、複数のレストランの食事注文ウェブサイトで、ユーザーはさまざまなレストランの食事をすべて 1 か所で閲覧して購入できます。",
    "Work History" : "職歴",
    "In the school of life, practical work is the ultimate curriculum." : "人生という学校においては、実践的な仕事こそが究極のカリキュラムです。",
    "Developed and maintained advanced ReactJS applications tailored for various industries, particularly focusing on the finance sector." : "特に金融分野に重点を置いて、さまざまな業界向けにカスタマイズされた高度な ReactJS アプリケーションを開発および保守しました。",
    "Managed application state using Redux for robust state handling." : "堅牢な状態処理のために Redux を使用してアプリケーションの状態を管理します。",
    "Led the maintenance of the front-end interface to ensure peak performance." : "最高のパフォーマンスを確保するためにフロントエンドインターフェースのメンテナンスを主導しました。" ,
    "Managed supplier relationships to secure cutting-edge technologies, keeping a competitive advantage in web development." : "最先端のテクノロジーを確保するためにサプライヤーとの関係を管理し、Web 開発における競争上の優位性を維持しました。",
    "Created cutting-edge design solutions for a variety of client projects, boosting brand visibility and engagement." : "さまざまなクライアント プロジェクト向けに最先端のデザイン ソリューションを作成し、ブランドの認知度とエンゲージメントを高めました。",
    "Proficient in Adobe Creative Suite (Photoshop, Illustrator) design software, guaranteeing timely delivery of high-quality results." : "Adobe Creative Suite (Photoshop、Illustrator) デザイン ソフトウェアに精通しており、高品質な結果をタイムリーに提供することを保証します。",
    "Level up your skills and unleash your potential! Each certification is a badge of honor on your journey to greatness" : "スキルをレベルアップし、潜在能力を解き放ちましょう！それぞれの認定資格は、偉大さへの道のりにおける名誉の証です。"

  }